Repository: mtzfederico/SwiftDNS
Catalog: Sources/SwiftDNS/Localizable.xcstrings
Source language: en
Languages: es

# DNSError.connectionClosed
source: Connection Closed
es: Conexión cerrada

# DNSError.connectionFailed %@
source: Connection failed: ‘%@’
es: Conexión fallida: ‘%@’

# DNSError.connectionIsNil
source: Connection is nil
es: Conexion es nil

# DNSError.connectionTypeMismatch
source: The connection type for the query doesn’t match the type of the DNSClient
es: El tipo de conexión para la consulta no coincide con el tipo de DNSClient

# DNSError.IDMismatch %hu %hu
source: Response ID doesn’t match query ID. Got: ‘%1$hu’ Expected: ‘%2$hu’
es: El ID de respuesta no coincide con el ID de la consulta. Respuesta: ‘%1$hu’ Consulta: ‘%2$hu’

# DNSError.invalidData %@
source: Received invalid data: ‘%@’
es: Datos inválidos recibidos: ‘%@’

# DNSError.invalidDomainName
source: Invalid Domain name
es: Dominio Invalido

# DNSError.invalidServerAddress
source: Invalid Server Address
es: Direccion de servidor invalida

# DNSError.namePointerLoop %ld %ld
source: Name decompression loop at %1$ld pointing to %2$ld
es: Bucle de descompresión de nombre en %1$ld que apunta a %2$ld

# DNSError.noDataReceived
source: No data received
es: No se recibieron datos

# DNSError.parsingError %@
source: Failed to parse data: ‘%@’
es: No se pudo procesar la respuesta: ‘%@’

# DNSError.responseTruncated
source: DNS Response Truncated. Retry using TCP.
es: Respuesta DNS truncada. Reinténtelo usando TCP.

# DNSError.unknownState %@
source: Unknown State: ‘%@’
es: Estado desconocido: ‘%@’
